#Использовать "."

КонсольнаяКоманда = "curl http://example.com \
|  -H 'accept: text/html' \
|  -H 'accept-language: ru,en-US;q=0.9,en;q=0.8' \
|  -H 'user-agent: curl'";

ПрограммныйКод = "Заголовки = Новый Соответствие();
|Заголовки.Вставить(""accept"", ""text/html"");
|Заголовки.Вставить(""accept-language"", ""ru,en-US;q=0.9,en;q=0.8"");
|Заголовки.Вставить(""user-agent"", ""curl"");
|
|ДополнительныеПараметры = Новый Структура();
|ДополнительныеПараметры.Вставить(""Заголовки"", Заголовки);
|
|Результат = КоннекторHTTP.Get(""http://example.com"", , ДополнительныеПараметры);";

КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКодаКоннекторHTTP());


Сообщить(Результат)