#Использовать asserts
#Использовать ".."

&Тест
Процедура ТестДолжен_ПроверитьЗаголовки() Экспорт

	КонсольнаяКоманда = "curl http://example.com \
	|  -H 'accept: text/html' \
	|  -H 'accept-language: ru,en-US;q=0.9,en;q=0.8' \
	|  -H 'user-agent: curl'";

	ПрограммныйКод = "Заголовки = Новый Соответствие();
	|Заголовки.Вставить(""accept"", ""text/html"");
	|Заголовки.Вставить(""accept-language"", ""ru,en-US;q=0.9,en;q=0.8"");
	|Заголовки.Вставить(""user-agent"", ""curl"");
	|
	|ДополнительныеПараметры = Новый Структура();
	|ДополнительныеПараметры.Вставить(""Заголовки"", Заголовки);
	|
	|Результат = КоннекторHTTP.Get(""http://example.com"", , ДополнительныеПараметры);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКодаКоннекторHTTP());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьИнициализациюЗаголовковТолькоОдинРаз() Экспорт

	КонсольнаяКоманда = "curl http://example1.com/page1 http://example2.com/page2 \
	|  -H 'accept: text/html";

	ПрограммныйКод = "Заголовки = Новый Соответствие();
	|Заголовки.Вставить(""accept"", ""text/html"");
	|
	|// Запрос 1. http://example1.com/page1
	|ДополнительныеПараметры = Новый Структура();
	|ДополнительныеПараметры.Вставить(""Заголовки"", Заголовки);
	|
	|Результат = КоннекторHTTP.Get(""http://example1.com/page1"", , ДополнительныеПараметры);
	|
	|// Запрос 2. http://example2.com/page2
	|ДополнительныеПараметры = Новый Структура();
	|ДополнительныеПараметры.Вставить(""Заголовки"", Заголовки);
	|
	|Результат = КоннекторHTTP.Get(""http://example2.com/page2"", , ДополнительныеПараметры);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКодаКоннекторHTTP());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьПередачуМетодаPOST() Экспорт

	КонсольнаяКоманда = "curl http://example.com -X POST";

	ПрограммныйКод = "Результат = КоннекторHTTP.Post(""http://example.com"");";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКодаКоннекторHTTP());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьПередачуПользователя() Экспорт

	КонсольнаяКоманда = "curl http://example.com -u user:secret";

	ПрограммныйКод = "Аутентификация = Новый Структура();
	|Аутентификация.Вставить(""Пользователь"", ""user"");
	|Аутентификация.Вставить(""Пароль"", ""secret"");
	|
	|ДополнительныеПараметры = Новый Структура();
	|ДополнительныеПараметры.Вставить(""Аутентификация"", Аутентификация);
	|
	|Результат = КоннекторHTTP.Get(""http://example.com"", , ДополнительныеПараметры);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКодаКоннекторHTTP());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьПередачуТекстовыхДанныхИзАргументовИФайлов() Экспорт

	КонсольнаяКоманда = "curl http://example.com \
	|	-d param1=value1 \
	|	--data-ascii 'парам2=значение2' \
	|	--data 'param3=value3' \
	|	--data @path-to-file1 \
	|	--data @path-to-file2 \
	|	--data-raw '@at@at@' \
	|	--data-binary @path-to-file3 \
	|	--data-binary 'param4=value4'";

	ПрограммныйКод = "ТекстовыйДокумент = Новый ТекстовыйДокумент();
	|ТекстовыйДокумент.Прочитать(""path-to-file1"");
	|ТекстовыеДанныеИзФайла_1 = ТекстовыйДокумент.ПолучитьТекст();
	|ТекстовыеДанныеИзФайла_1 = СтрЗаменить(ТекстовыеДанныеИзФайла_1, Символы.ПС, """");
	|ТекстовыеДанныеИзФайла_1 = СтрЗаменить(ТекстовыеДанныеИзФайла_1, Символы.ВК, """");
	|
	|ТекстовыйДокумент = Новый ТекстовыйДокумент();
	|ТекстовыйДокумент.Прочитать(""path-to-file2"");
	|ТекстовыеДанныеИзФайла_2 = ТекстовыйДокумент.ПолучитьТекст();
	|ТекстовыеДанныеИзФайла_2 = СтрЗаменить(ТекстовыеДанныеИзФайла_2, Символы.ПС, """");
	|ТекстовыеДанныеИзФайла_2 = СтрЗаменить(ТекстовыеДанныеИзФайла_2, Символы.ВК, """");
	|
	|ТекстовыйДокумент = Новый ТекстовыйДокумент();
	|ТекстовыйДокумент.Прочитать(""path-to-file3"");
	|ТекстовыеДанныеИзФайла_3 = ТекстовыйДокумент.ПолучитьТекст();
	|
	|Данные = ""param1=value1&парам2=значение2&param3=value3&@at@at@&param4=value4""
	|	+ ""&"" + ТекстовыеДанныеИзФайла_1
	|	+ ""&"" + ТекстовыеДанныеИзФайла_2
	|	+ ""&"" + ТекстовыеДанныеИзФайла_3;
	|
	|Результат = КоннекторHTTP.Post(""http://example.com"", Данные);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКодаКоннекторHTTP());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьИнициализациюТелаЗапросаТолькоОдинРаз() Экспорт

	КонсольнаяКоманда = "curl http://example1.com http://example2.com \
	|	-d param=value \
	|	--data @path-to-file";

	ПрограммныйКод = "ТекстовыйДокумент = Новый ТекстовыйДокумент();
	|ТекстовыйДокумент.Прочитать(""path-to-file"");
	|ТекстовыеДанныеИзФайла_1 = ТекстовыйДокумент.ПолучитьТекст();
	|ТекстовыеДанныеИзФайла_1 = СтрЗаменить(ТекстовыеДанныеИзФайла_1, Символы.ПС, """");
	|ТекстовыеДанныеИзФайла_1 = СтрЗаменить(ТекстовыеДанныеИзФайла_1, Символы.ВК, """");
	|
	|Данные = ""param=value""
	|	+ ""&"" + ТекстовыеДанныеИзФайла_1;
	|
	|// Запрос 1. http://example1.com
	|Результат = КоннекторHTTP.Post(""http://example1.com"", Данные);
	|
	|// Запрос 2. http://example2.com
	|Результат = КоннекторHTTP.Post(""http://example2.com"", Данные);";

	КонвертерКомандыCURL = Новый КонвертерКомандыCURL();
	Результат = КонвертерКомандыCURL.Конвертировать(КонсольнаяКоманда, Новый ГенераторПрограммногоКодаКоннекторHTTP());

	Ожидаем.Что(Результат).Равно(ПрограммныйКод);
	
КонецПроцедуры